[
    {
      "format": "layers-model",
      "generatedBy": "keras v2.4.0",
      "convertedBy": "TensorFlow.js Converter v2.4.0",
      "modelTopology": {
        "keras_version": "2.4.0",
        "backend": "tensorflow",
        "model_config": {
          "class_name": "Model",
          "config": {
            "name": "functional_1",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [null, 2048],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "input_1"
                },
                "name": "input_1",
                "inbound_nodes": []
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1000,
                  "activation": "linear",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": { "seed": null }
                  },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                },
                "name": "dense",
                "inbound_nodes": [ [ ["input_1", 0, 0, {}] ] ]
              }
            ],
            "input_layers": [ ["input_1", 0, 0] ],
            "output_layers": [ ["dense", 0, 0] ]
          }
        }
      },
      "weightsManifest": [
        {
          "paths": ["group1-shard1of1.bin"],
          "weights": [
            { "name": "dense/kernel", "shape": [2048, 1000], "dtype": "float32" },
            { "name": "dense/bias", "shape": [1000], "dtype": "float32" }
          ]
        }
      ]
    },
    {
      "format": "layers-model",
      "generatedBy": "keras v2.4.0",
      "convertedBy": "TensorFlow.js Converter v2.4.0",
      "modelTopology": {
        "keras_version": "2.4.0",
        "backend": "tensorflow",
        "model_config": {
          "class_name": "Model",
          "config": {
            "name": "functional_1",
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [null, 2048],
                  "dtype": "float32",
                  "sparse": false,
                  "ragged": false,
                  "name": "input_1"
                },
                "name": "input_1",
                "inbound_nodes": []
              },
              {
                "class_name": "Dense",
                "config": {
                  "name": "dense",
                  "trainable": true,
                  "dtype": "float32",
                  "units": 1000,
                  "activation": "linear",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": { "seed": null }
                  },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "kernel_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "bias_constraint": null
                },
                "name": "dense",
                "inbound_nodes": [ [ ["input_1", 0, 0, {}] ] ]
              }
            ],
            "input_layers": [ ["input_1", 0, 0] ],
            "output_layers": [ ["dense", 0, 0] ]
          }
        }
      },
      "weightsManifest": [
        {
          "paths": ["group1-shard1of1.bin"],
          "weights": [
            { "name": "dense/kernel", "shape": [2048, 1000], "dtype": "float32" },
            { "name": "dense/bias", "shape": [1000], "dtype": "float32" }
          ]
        }
      ]
    }
  ]
  